yuh404/Smart-Garden/STM32/STM32_ESP32_MAIN.c
#include "STM32_ESP32.h"
#include "SYSCLK.h"
#include "UART_CONFIG.h"
#include "setting.h"
#include "NVIC.h"
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include "systick.h"
#include "HCSR04.h"
#include "dien_dung.h"
#include "BH1750.h"
#include "HDC_1018.h"

/* --- FreeRTOS --- */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

/* ========================================================================== */
/* DEFINES                                  */
/* ========================================================================== */
#define RX_BUFFER_SIZE 128
#define PUMP_PORT GPIOB
#define PUMP_PIN_1  GPIO_Pin_1
#define PUMP_PIN_2  GPIO_Pin_3
#define MAX_WATERING_DURATION_MS 10000
#define PUMP_PIN_3	GPIO_Pin_4
#define PUMP_FLOW_RATE 23.0f
#define FILTER_SIZE 10
#define ADC_DRY 3200.0f
#define ADC_WET 1500.0f

/* Chu ky cac task (ms) */
#define SENSOR_READ_INTERVAL_MS   5000
#define TELEMETRY_SEND_INTERVAL_MS 60000
#define PUMP_TASK_PERIOD_MS       100

/* ========================================================================== */
/* GLOBAL VARIABLES                             */
/* ========================================================================== */
extern DeviceSettings_t current_settings;
plant plant_list[MAX_PLANTS];

const uint8_t DISTANCE_MIN = 10;
const uint8_t DISTANCE_MAX = 50;
static uint32_t last_led_toggle_time = 0;
const uint32_t LED_INTERVAL = 500;

volatile bool is_refilling = false;
volatile bool is_plant1_auto = false;
volatile bool is_plant2_auto = false;
volatile bool is_water_all = false;
volatile bool is_water_all_active = false;

volatile bool is_pump_1_watering = false;
volatile bool is_pump_2_watering = false;
uint32_t pump_1_start_time = 0;
uint32_t pump_2_start_time = 0;
uint16_t PUMP_PINS[MAX_PLANTS] = {PUMP_PIN_1, PUMP_PIN_2};
uint8_t ADC_CHANNELS[MAX_PLANTS] = {1, 3};
float DIRT_ALL[2];
float volumn;
float volumn_percent;
uint32_t refill_start_time = 0;

plant plant_1 = {"p001", 1, 0,0,200};
plant plant_2 = {"p002", 1, 0,0,200};

float time_pump_plant1;
float time_pump_plant2;
int plant_count = 0;

float distance_buffer[FILTER_SIZE];
int filter_idx = 0;
float filtered_distance = 30.0f;
const float alpha = 0.2f;

/* ========================================================================== */
/* RTOS OBJECTS                              */
/* ========================================================================== */
/* Bao ve toan bo du lieu dung chung: plant_list[], current_settings,
   filtered_distance, volumn, is_refilling, is_water_all_active...        */
static SemaphoreHandle_t xPlantDataMutex;
/* Bao ve viec goi USART1_SendString() tu nhieu task cung luc            */
static SemaphoreHandle_t xUartTxMutex;
/* ISR UART day chuoi lenh da nhan hoan chinh vao day, Task_CommandProcess doc ra */
static QueueHandle_t xUartRxQueue;

/* ========================================================================== */
/* FUNCTION PROTOTYPES                            */
/* ========================================================================== */
void water_all(void);
void water_refill(void);
void water_once(const char* plant_id);
void set_motor( int mode);
void set_soil_schedule(const char* plant_id, int target_moisture);
void set_water_amount_schedule(const char* plant_id, int water_amount);
void set_auto_status(const char* plant_id, int auto_status);
void create_new_plant(const char* name, int auto_status);
void HandleWaterAllLogic(void);
void HandleAutoWatering(plant *p, float current_dirt, int threshold, uint16_t pump_pin);
void HandleWaterOnce(plant *p, float current_dirt, int threshold, uint16_t pump_pin,float time);
int Add_Plant(const char* id);
int Delete_Plant(const char* id);
int FindPlantIndex(const char* id);
void SyncAndSaveSettings(void);
float Get_Filtered_Distance(float new_val);
void Update_Filtered_Distance(void);
void Delay_ms(uint32_t ms);
void ProcessCommand(const char *command_str);
float HDC1080_ConvertTemperature(uint16_t raw_temp);
float HDC1080_ConvertHumidity(uint16_t raw_humi);
bool HDC1080_Check(void);
static void Safe_UART_Send(const char *str);

/* RTOS task functions */
static void Task_SensorRead(void *pvParameters);
static void Task_CommandProcess(void *pvParameters);
static void Task_PumpControl(void *pvParameters);
static void Task_DataSend(void *pvParameters);

/* ========================================================================== */
/* MAIN                                    */
/* ========================================================================== */
int main(void){
	RCC->APB2ENR |= (1 << 4);
	RCC->APB2ENR |= (1 << 3);
	RCC->APB2ENR |= (1 << 2);

	GPIOC->CRH &= ~(0xF << 20);
	GPIOC->CRH |= (0x3 << 20);
	GPIOC->BSRR = (1 << 13);

	GPIOB->CRL &= ~(0xF << 4);
	GPIOB->CRL |= (0x3 << 4);

	GPIOB->CRL &= ~(0xF << 0);
	GPIOB->CRL |= (0x1 << 0);

	GPIOB->CRL &= ~(0xF << 12);
	GPIOB->CRL |= (0x3 << 12);

	GPIOB->CRL &= ~(0xF << 16);
	GPIOB->CRL |= (0x3 << 16);

	GPIO_SetBits(PUMP_PORT, PUMP_PIN_1);
	GPIO_SetBits(PUMP_PORT, PUMP_PIN_2);

	SYSCLK_INIT();
	USART1_Config();

	RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;
	AFIO->MAPR &= ~(0x7 << 24);
	AFIO->MAPR |= (0x2 << 24);

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
	ADC1_Register_Init_Calibrated();
	I2C2_Init();
	BH1750_Init();
	I2C1_Init();
    HCSR04_Init();
    HDC1080_Init();

	/* LUU Y: KHONG goi SysTick_Init() nua - FreeRTOS (port.c) se tu cau hinh
	   SysTick lam nguon tick rieng cho no khi vTaskStartScheduler() chay.
	   Ham Get_Current_Time_MS() (trong systick.c) can duoc sua lai de tra ve
	   xTaskGetTickCount() * portTICK_PERIOD_MS thay vi dem SysTick thu cong. */

	/* Bat buoc: dat toan bo 4 bit NVIC cho preemption priority TRUOC khi
	   cau hinh bat ky ngat nao dung API FreeRTOS tu ISR (vd USART1_IRQHandler) */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

	/* Uu tien phai >= 5 (so lon hon = uu tien thap hon) vi ISR nay se goi
	   xQueueSendFromISR(), phai yeu hon configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY */
	NVIC_Config_USART1(5, 0);
	/* TIM2 (dung boi HCSR04) khong goi API FreeRTOS nen giu nguyen uu tien cao */
	NVIC_Config_TIM2(0, 0);

	/* Tao cac doi tuong dong bo hoa TRUOC khi tao task va TRUOC khi cho phep ngat dung chung */
	xPlantDataMutex = xSemaphoreCreateMutex();
	xUartTxMutex    = xSemaphoreCreateMutex();
	xUartRxQueue    = xQueueCreate(5, RX_BUFFER_SIZE);

	if (xPlantDataMutex == NULL || xUartTxMutex == NULL || xUartRxQueue == NULL) {
		/* Khong du RAM de tao doi tuong RTOS - dung lai o day de de debug */
		while (1) {}
	}

	for (int i = 0; i < MAX_PLANTS; i++) {
        memcpy(&plant_list[i], &current_settings.plants[i], sizeof(plant));
        if (plant_list[i].is_active) {
            plant_count++;
        }
    }

	Safe_UART_Send("#SYSTEM INIT OK\n");

