yuh404/Smart-Garden/STM32/STM32_ESP32_MAIN.c
	/* Stack size tinh theo WORD (4 byte/word tren Cortex-M3), khong phai byte */
	xTaskCreate(Task_SensorRead,     "Sensor", 128, NULL, 2, NULL);
	xTaskCreate(Task_CommandProcess, "Cmd",    160, NULL, 3, NULL);
	xTaskCreate(Task_PumpControl,    "Pump",   128, NULL, 2, NULL);
	xTaskCreate(Task_DataSend,       "Send",   128, NULL, 1, NULL);

	vTaskStartScheduler();

	/* Khong bao gio toi day, tru khi het heap luc scheduler khoi dong */
	while (1) {}
}

/* ========================================================================== */
/* RTOS TASKS                                */
/* ========================================================================== */

static void Task_SensorRead(void *pvParameters) {
    (void)pvParameters;
    uint16_t raw_temp = 0, raw_humi = 0;

    for (;;) {
        raw_temp = HDC1080_ReadTemperatureRaw();
        HCSR04_Trigger();
        vTaskDelay(pdMS_TO_TICKS(30)); /* thay cho Delay_ms(30) - nhuong CPU thay vi busy-wait */

        if (xSemaphoreTake(xPlantDataMutex, pdMS_TO_TICKS(200)) == pdTRUE) {
            Update_Filtered_Distance();

            for (int i = 0; i < MAX_PLANTS; i++) {
                uint16_t adc_val = ADC1_Read_Channel(plant_list[i].adc_channel);
                float moisture = ((float)adc_val - ADC_DRY) / (ADC_WET - ADC_DRY) * 100.0f;
                if (moisture > 100.0f) moisture = 100.0f;
                if (moisture < 0.0f)   moisture = 0.0f;
                plant_list[i].current_dirt = moisture;
            }

            current_settings.lux = BH1750_ReadLux();
            raw_humi = HDC1080_ReadHumidityRaw();
            current_settings.raw_temp = HDC1080_ConvertTemperature(raw_temp);
            current_settings.raw_humi = HDC1080_ConvertHumidity(raw_humi);
            volumn = ((0.5 - Distance * 0.01) * 3.14 * 0.04 * 0.04) * 1000000;

            xSemaphoreGive(xPlantDataMutex);
        }

        vTaskDelay(pdMS_TO_TICKS(SENSOR_READ_INTERVAL_MS));
    }
}

static void Task_CommandProcess(void *pvParameters) {
    (void)pvParameters;
    char cmd_buf[RX_BUFFER_SIZE];

    for (;;) {
        if (xQueueReceive(xUartRxQueue, cmd_buf, portMAX_DELAY) == pdTRUE) {
            if (xSemaphoreTake(xPlantDataMutex, pdMS_TO_TICKS(200)) == pdTRUE) {
                ProcessCommand(cmd_buf);
                xSemaphoreGive(xPlantDataMutex);
            }
        }
    }
}

static void Task_PumpControl(void *pvParameters) {
    (void)pvParameters;

    for (;;) {
        if (xSemaphoreTake(xPlantDataMutex, pdMS_TO_TICKS(200)) == pdTRUE) {
            for (int i = 0; i < MAX_PLANTS; i++) {
                float time_needed = (float)plant_list[i].water_amount / PUMP_FLOW_RATE;
                HandleWaterOnce(&plant_list[i], plant_list[i].current_dirt, plant_list[i].threshold, plant_list[i].pump_pin, time_needed);
                HandleAutoWatering(&plant_list[i], plant_list[i].current_dirt, plant_list[i].threshold, plant_list[i].pump_pin);
            }
            HandleWaterAllLogic();
            water_refill();
            xSemaphoreGive(xPlantDataMutex);
        }
        vTaskDelay(pdMS_TO_TICKS(PUMP_TASK_PERIOD_MS));
    }
}

static void Task_DataSend(void *pvParameters) {
    (void)pvParameters;
    /* tx_buffer la static, khong nam tren stack cua task -> tiet kiem RAM dang ke
       (RAM chi 20KB nen tranh de buffer 512 byte lam bien local trong task) */
    static char tx_buffer[512];
    static char plant_line[128];

    /* snapshot du lieu can gui, lay ra khoi vung nho dung chung truoc khi format+gui,
       de khong giu xPlantDataMutex trong luc goi UART (tranh giu 2 mutex cung luc) */
    float snap_temp, snap_humi, snap_lux, snap_dist, snap_volumn;
    int   snap_plant_count;
    char  snap_id[MAX_PLANTS][20];
    float snap_soil[MAX_PLANTS];
    float snap_threshold[MAX_PLANTS];
    int   snap_water_amount[MAX_PLANTS];
    bool  snap_active[MAX_PLANTS];

    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(TELEMETRY_SEND_INTERVAL_MS));

        if (xSemaphoreTake(xPlantDataMutex, pdMS_TO_TICKS(200)) == pdTRUE) {
            snap_temp = current_settings.raw_temp;
            snap_humi = current_settings.raw_humi;
            snap_lux  = current_settings.lux;
            snap_dist = filtered_distance;
            snap_volumn = volumn;
            snap_plant_count = plant_count;
            for (int i = 0; i < MAX_PLANTS; i++) {
                snap_active[i] = plant_list[i].is_active;
                strncpy(snap_id[i], plant_list[i].plant_id, sizeof(snap_id[i]) - 1);
                snap_id[i][sizeof(snap_id[i]) - 1] = '\0';
                snap_soil[i] = plant_list[i].current_dirt;
                snap_threshold[i] = plant_list[i].threshold;
                snap_water_amount[i] = plant_list[i].water_amount;
            }
            xSemaphoreGive(xPlantDataMutex);
        } else {
            continue; /* khong lay duoc du lieu ky nay thi bo qua, cho ky sau */
        }

        sprintf(tx_buffer, "#DATA:{\"type\":\"plants\",\"temp\":%.1f,\"humi\":%.1f,\"lux\":%.1f,\"dist\":%.1f,\"p_count\":%d,\"volumn\":%.1f}\n",
            snap_temp, snap_humi, snap_lux, snap_dist, snap_plant_count, snap_volumn);
        Safe_UART_Send(tx_buffer);

        for (int i = 0; i < MAX_PLANTS; i++) {
            if (!snap_active[i]) continue;
            sprintf(plant_line, "#DATA:{\"type\":\"plant\",\"id\":\"%s\",\"soil\":%.1f,\"th\":%.1f,\"w\":%d}\n",
                    snap_id[i], snap_soil[i], snap_threshold[i], snap_water_amount[i]);
            Safe_UART_Send(plant_line);
        }
    }
}

/* ========================================================================== */
/* FUNCTION DEFINITIONS                           */
/* ========================================================================== */

/* Vi task dung vTaskDelay(), Delay_ms() bay gio chi con dung cho cac doan code
   chay TRUOC khi vTaskStartScheduler() (neu can). Sau khi scheduler chay,
   LUON dung vTaskDelay() thay cho ham nay de khong chan CPU cua task khac. */
void Delay_ms(uint32_t ms) {
    uint32_t total_iterations = ms * 3600;
    for (volatile uint32_t i = 0; i < total_iterations; i++) {
        __asm("nop");
    }
}

