yuh404/Smart-Garden/STM32/STM32_ESP32_MAIN.c
/* Wrapper bao ve USART1_SendString() bang mutex, dung o moi noi trong file nay
   thay vi goi truc tiep USART1_SendString(), vi ham co the duoc goi tu nhieu task */
static void Safe_UART_Send(const char *str) {
    if (xUartTxMutex == NULL) {
        USART1_SendString((char*)str);
        return;
    }
    if (xSemaphoreTake(xUartTxMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        USART1_SendString((char*)str);
        xSemaphoreGive(xUartTxMutex);
    }
}

void USART1_IRQHandler(void) {
    static uint8_t local_rx_buffer[RX_BUFFER_SIZE];
    static uint8_t local_rx_index = 0;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if (USART_GetITStatus(USART1, USART_IT_RXNE) != RESET) {
        uint8_t rx_char = USART_ReceiveData(USART1);
        if (rx_char == '\n' || rx_char == '\r') {
            if (local_rx_index > 0) {
                local_rx_buffer[local_rx_index] = '\0';
                /* Day ban sao chuoi lenh vao queue, Task_CommandProcess se nhan va xu ly */
                xQueueSendFromISR(xUartRxQueue, local_rx_buffer, &xHigherPriorityTaskWoken);
                local_rx_index = 0;
            }
        } else if (local_rx_index < RX_BUFFER_SIZE - 1) {
            local_rx_buffer[local_rx_index++] = rx_char;
        }
    }
    if (USART_GetITStatus(USART1, USART_IT_ORE) != RESET) {
        USART_ReceiveData(USART1);
    }

    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
}

void ProcessCommand(const char *command_str) {
    while (*command_str == ' ' || *command_str == '\r' || *command_str == '\n') command_str++;
    if (strncmp(command_str, "#CMD:", 5) != 0) return;
    const char *json = command_str + 5;
    char plant_id[20];
    int target, auto_status, water_amount;
    char buf[128];

    if (strstr(json, "\"action\":\"refill\"")){
        is_refilling = true;
        refill_start_time = Get_Current_Time_MS();
    }
    else if (strstr(json, "\"action\":\"water_all\"")) {
        for(int i=0; i<MAX_PLANTS; i++) { if(plant_list[i].water_now) return; }
        water_all();
    }
    else if (strstr(json, "\"action\":\"Open\"")) {
        set_motor(1);
        Safe_UART_Send("#ACK:{\"type\":\"motor_ack\",\"status\":\"ok\",\"action\":\"Open\"}\n");
    }
    else if (strstr(json, "\"action\":\"Close\"")) {
        set_motor(0);
        Safe_UART_Send("#ACK:{\"type\":\"motor_ack\",\"status\":\"ok\",\"action\":\"Close\"}\n");
    }
    else if (strstr(json, "\"action\":\"create_plant\"")) {
        char *id_ptr = strstr(json, "\"plant_id\":\"");
        char *name_ptr = strstr(json, "\"name\":\"");
        char plant_name[32] = {0};
        if (id_ptr) {
            sscanf(id_ptr + 12, "%[^\"]", plant_id);
            if (name_ptr) sscanf(name_ptr + 8, "%[^\"]", plant_name);
            else strcpy(plant_name, "Unknown");
            int res = Add_Plant(plant_id);
            if (res == 0) {
                sprintf(buf, "#ACK:{\"type\":\"create_plant_ack\",\"status\":\"ok\",\"plant_id\":\"%s\",\"name\":\"%s\"}\n", plant_id, plant_name);
                Safe_UART_Send(buf);
            }
            else if (res == -1) Safe_UART_Send("#ERR:{\"type\":\"create_plant_err\",\"message\":\"PLANT_LIST_FULL\"}\n");
            else if (res == -2) Safe_UART_Send("#ERR:{\"type\":\"create_plant_err\",\"message\":\"PLANT_EXISTS\"}\n");
        }
    }
    else if (strstr(json, "\"action\":\"remove_plant\"")) {
        char *id_ptr = strstr(json, "\"plant_id\":\"");
        if (id_ptr) {
            sscanf(id_ptr + 12, "%[^\"]", plant_id);
            int res = Delete_Plant(plant_id);
            if (res == 0) {
                sprintf(buf, "#ACK:{\"type\":\"delete_plant_ack\",\"status\":\"ok\",\"plant_id\":\"%s\"}\n", plant_id);
                Safe_UART_Send(buf);
            } else {
                sprintf(buf, "#ERR:DELETE:{\"status\":\"error\",\"message\":\"plant_not_found\",\"plant_id\":\"%s}\n", plant_id);
                Safe_UART_Send(buf);
            }
        }
    }
    else if (strstr(json, "\"plant_id\":\"") && strstr(json, "\"auto\":")) {
        char *id_ptr = strstr(json, "\"plant_id\":\"") + 12;
        sscanf(id_ptr, "%[^\"]", plant_id);
        auto_status = (strstr(json, "\"auto\":true") != NULL) ? 1 : 0;
        set_auto_status(plant_id, auto_status);
    }
    else if (strstr(json, "\"action\":\"water_once\"")) {
        char *id_ptr = strstr(json, "\"plant_id\":\"");
        if (id_ptr) {
            sscanf(id_ptr + 12, "%[^\"]", plant_id);
            if (!is_water_all_active) water_once(plant_id);
        }
    }
    else if (strstr(json, "\"targetMoisture\":")) {
        char *id_ptr = strstr(json, "\"plant_id\":\"") + 12;
        sscanf(id_ptr, "%[^\"]", plant_id);
        char *target_ptr = strstr(json, "\"targetMoisture\":") + 17;
        sscanf(target_ptr, "%d", &target);
        if (target >= 0 && target <= 100) {
            set_soil_schedule(plant_id, target);
            sprintf(buf, "#ACK:{\"type\":\"soil_ack\",\"status\":\"ok\",\"plantId\":\"%s\",\"targetMoisture\":%d}\n", plant_id, target);
            Safe_UART_Send(buf);
        }
    }
    else if (strstr(json, "\"water_amount\":")) {
        char *id_ptr = strstr(json, "\"plant_id\":\"");
        char *amount_ptr = strstr(json, "\"water_amount\":");
        if (id_ptr && amount_ptr) {
            sscanf(id_ptr + 12, "%[^\"]", plant_id);
            sscanf(amount_ptr + 15, "%d", &water_amount);
            if (water_amount >= 0) set_water_amount_schedule(plant_id, water_amount);
        }
    }
    else { Safe_UART_Send("#ERROR:INVALID_CMD\n"); }
}

float HDC1080_ConvertTemperature(uint16_t raw_temp) { return ((float)raw_temp / 65536.0f) * 165.0f - 40.0f; }
float HDC1080_ConvertHumidity(uint16_t raw_humi) { return ((float)raw_humi / 65536.0f) * 100.0f; }

bool HDC1080_Check(void) {
    bool status = I2C_StartAndSendAddr(HDC1080_ADDR, I2C_Direction_Transmitter);
    I2C_GenerateSTOP(I2C1, ENABLE);
    return status;
}

void water_refill(void) {
    if (!is_refilling) return;
    char buf[128];
    const uint32_t REFILL_TIMEOUT_MS = 20000;
    uint32_t current_time = Get_Current_Time_MS();
    uint32_t elapsed = current_time - refill_start_time;
    Update_Filtered_Distance();
    if (filtered_distance <= DISTANCE_MIN || elapsed >= REFILL_TIMEOUT_MS) {
        GPIOB->BSRR = (1 << 0);
        is_refilling = false;
        if (elapsed >= REFILL_TIMEOUT_MS) Safe_UART_Send("#ERR:{\"type\":\"refill_error\",\"msg\":\"TIMEOUT_TANK_NOT_FULL\"}\n");
        else {
            volumn = ((0.5 - filtered_distance * 0.01) * 3.14 * 0.04 * 0.04) * 1000000;
            if (volumn < 0) volumn = 0;
            sprintf(buf, "#ACK:{\"type\":\"refill_ack\",\"status\":\"ok\",\"volumn\":%.1f}\n", volumn);
            Safe_UART_Send(buf);
        }
        refill_start_time = 0;
    } else { GPIOB->BSRR = (1 << (0 + 16)); }
}

