yuh404/Smart-Garden/STM32/STM32_ESP32_MAIN.c
void water_all(void) {
    for(int i = 0; i < MAX_PLANTS; i++) {
        if(plant_list[i].is_active) {
            GPIO_SetBits(PUMP_PORT, plant_list[i].pump_pin);
            plant_list[i].auto_water_start_time = 0;
        }
    }
    is_water_all_active = true;
}

void HandleWaterAllLogic(void) {
    char buf[128];
    if (!is_water_all_active) return;
    uint32_t current_time = Get_Current_Time_MS();
    bool all_done = true;
    for (int i = 0; i < MAX_PLANTS; i++) {
        if (!plant_list[i].is_active) continue;
        float time_needed_ms = ((float)plant_list[i].water_amount / PUMP_FLOW_RATE) * 1000.0f;
        if (plant_list[i].auto_water_start_time == 0) {
             GPIO_ResetBits(PUMP_PORT, plant_list[i].pump_pin);
             plant_list[i].auto_water_start_time = current_time;
        }
        uint32_t elapsed = current_time - plant_list[i].auto_water_start_time;
        if (elapsed < time_needed_ms) all_done = false;
        else GPIO_SetBits(PUMP_PORT, plant_list[i].pump_pin);
    }
    if (all_done) {
        is_water_all_active = false;
        for(int i=0; i<plant_count; i++){
            plant_list[i].auto_water_start_time = 0;
            uint16_t adc_val = ADC1_Read_Channel(plant_list[i].adc_channel);
            DIRT_ALL[i] = ((4000.0f - adc_val) / 2500.0f) * 100.0f;
            sprintf(buf,"#ACK:{\"type\":\"water_all_ack\",\"status\":\"ok\",\"%s\":%.1f,\"volumn\":%.1f}\n",plant_list[i].plant_id, DIRT_ALL[i], 1000.0);
            Safe_UART_Send(buf);
        }
    }
}

void set_auto_status(const char* plant_id, int auto_status) {
    char buf[128];
    int idx = FindPlantIndex(plant_id);
    if (idx != -1) {
        plant_list[idx].auto_water = auto_status;
        sprintf(buf, "#ACK:{\"type\":\"auto_ack\",\"status\":\"ok\",\"plant_id\":\"%s\",\"auto\":%s}\n", plant_id, auto_status ? "true" : "false");
        Safe_UART_Send(buf);
    } else { Safe_UART_Send("#ERR:PLANT_NOT_FOUND\n"); }
}

void HandleAutoWatering(plant *p, float current_dirt, int threshold, uint16_t pump_pin) {
    if (p->water_now || is_water_all_active|| !(p->is_active)) return;
    uint32_t current_time = Get_Current_Time_MS();
    if (p->auto_water ) {
        if (current_dirt < threshold && p->auto_water_start_time == 0) {
            GPIO_ResetBits(PUMP_PORT, pump_pin);
            p->auto_water_start_time = current_time;
        }
        if (p->auto_water_start_time != 0) {
            bool is_soil_wet = (current_dirt >= threshold);
            if (is_soil_wet) {
                GPIO_SetBits(PUMP_PORT, pump_pin);
                p->auto_water_start_time = 0;
                uint16_t adc_val = ADC1_Read_Channel(p->adc_channel);
                float post_water_dirt = ((4000.0f - adc_val) / 2500.0f) * 100.0f;
                char buf[128];
                sprintf(buf, "#DATA:{\"type\":\"auto_water_done\",\"id\":\"%s\",\"soil\":%.1f}\n", p->plant_id, post_water_dirt);
                Safe_UART_Send(buf);
            }
        }
    }
    else if (!p->auto_water) {
         if (p->auto_water_start_time != 0) {
             GPIO_SetBits(PUMP_PORT, pump_pin);
             p->auto_water_start_time = 0;
         }
    }
}

void water_once(const char* plant_id) {
    int idx = FindPlantIndex(plant_id);
    if (idx != -1) plant_list[idx].water_now = 1;
}

void HandleWaterOnce(plant *p, float current_dirt, int threshold, uint16_t pump_pin, float time) {
    if (!p->water_now) return;
    uint32_t current_time = Get_Current_Time_MS();
    uint32_t duration_ms = (uint32_t)(time * 1000.0f);
    const uint32_t ABSOLUTE_TIMEOUT_MS = 30000;
    if (p->auto_water_start_time == 0) {
        GPIO_ResetBits(PUMP_PORT, pump_pin);
        p->auto_water_start_time = current_time;
    }
    uint32_t elapsed = current_time - p->auto_water_start_time;
    if (elapsed >= duration_ms || elapsed >= ABSOLUTE_TIMEOUT_MS) {
        GPIO_SetBits(PUMP_PORT, pump_pin);
        p->auto_water_start_time = 0;
        p->water_now = 0;
        uint16_t adc_val = ADC1_Read_Channel(p->adc_channel);
        float post_water_dirt = ((4000.0f - adc_val) / 2500.0f) * 100.0f;
        char buf[128];
        if (elapsed >= ABSOLUTE_TIMEOUT_MS && elapsed < duration_ms) {
            sprintf(buf, "#WARN:{\"type\":\"water_once_timeout\",\"plant_id\":\"%s\",\"msg\":\"Safety limit reached\"}\n", p->plant_id);
        } else {
            sprintf(buf, "#ACK:{\"type\":\"water_once_ack\",\"status\":\"ok\",\"plant_id\":\"%s\",\"soil\":%.1f,\"volumn\":%.1f}\n", p->plant_id, post_water_dirt, 1000.0);
        }
        Safe_UART_Send(buf);
    }
}

void set_soil_schedule(const char* plant_id, int target_moisture) {
    int idx = FindPlantIndex(plant_id);
    if (idx != -1) plant_list[idx].threshold = (float)target_moisture;
}

void set_motor( int mode) {
	if(mode) GPIO_ResetBits(PUMP_PORT, PUMP_PIN_3);
	else GPIO_SetBits(PUMP_PORT, PUMP_PIN_3);
}

void set_water_amount_schedule(const char* plant_id, int water_amount) {
    bool found = false;
    char buf[128];
    for (int i = 0; i < plant_count; i++) {
        if (strcmp(plant_list[i].plant_id, plant_id) == 0) {
            plant_list[i].water_amount = water_amount;
            found = true;
            sprintf(buf, "#ACK:{\"type\":\"set_water_ack\",\"status\":\"ok\",\"plant_id\":\"%s\",\"water_amount\":%d}\n", plant_id, water_amount);
            Safe_UART_Send(buf);
            break;
        }
    }
    if (!found) Safe_UART_Send("#ERR:SET_AMOUNT:PLANT_NOT_FOUND\n");
}

int Add_Plant(const char* id) {
    for (int i = 0; i < MAX_PLANTS; i++) {
        if (plant_list[i].is_active && strcmp(plant_list[i].plant_id, id) == 0) return -2;
    }
    int empty_slot = -1;
    for (int i = 0; i < MAX_PLANTS; i++) {
        if (!plant_list[i].is_active) { empty_slot = i; break; }
    }
    if (empty_slot == -1) return -1;
    memset(&plant_list[empty_slot], 0, sizeof(plant));
    strcpy(plant_list[empty_slot].plant_id, id);
    plant_list[empty_slot].threshold = 50.0f;
    plant_list[empty_slot].auto_water = 0;
    plant_list[empty_slot].water_now = 0;
    plant_list[empty_slot].water_amount = 100;
    plant_list[empty_slot].pump_pin = PUMP_PINS[empty_slot];
    plant_list[empty_slot].adc_channel = ADC_CHANNELS[empty_slot];
    plant_list[empty_slot].is_active = true;
    plant_count++;
    return 0;
}

int Delete_Plant(const char* id) {
    int idx = FindPlantIndex(id);
    if (idx != -1) {
        GPIO_SetBits(PUMP_PORT, plant_list[idx].pump_pin);
        plant_list[idx].is_active = false;
        memset(plant_list[idx].plant_id, 0, sizeof(plant_list[idx].plant_id));
        if (plant_count > 0) plant_count--;
        return 0;
    }
    return -1;
}

int FindPlantIndex(const char* id) {
    for (int i = 0; i < MAX_PLANTS; i++) {
        if (plant_list[i].is_active && strcmp(plant_list[i].plant_id, id) == 0) return i;
    }
    return -1;
}

void SyncAndSaveSettings(void) {
    for (int i = 0; i < MAX_PLANTS; i++) memcpy(&current_settings.plants[i], &plant_list[i], sizeof(plant));
}

float Get_Filtered_Distance(float new_val) {
    distance_buffer[filter_idx++] = new_val;
    if (filter_idx >= FILTER_SIZE) filter_idx = 0;
    float sum = 0;
    for (int i = 0; i < FILTER_SIZE; i++) sum += distance_buffer[i];
    return sum / FILTER_SIZE;
}

void Update_Filtered_Distance(void) {
    if (Distance > 2 && Distance < 400) {
        filtered_distance = (alpha * (float)Distance) + ((1.0f - alpha) * filtered_distance);
    }
}

/* ========================================================================== */
/* FREERTOS HOOKS (bat buoc phai co vi da bat trong FreeRTOSConfig.h)          */
/* ========================================================================== */
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName) {
    (void)xTask;
    (void)pcTaskName;
    /* Tran stack cua 1 task - dung lai de debug thay vi chay tiep sai lech */
    taskDISABLE_INTERRUPTS();
    for (;;) {}
}

void vApplicationMallocFailedHook(void) {
    /* Het heap FreeRTOS (configTOTAL_HEAP_SIZE khong du) */
    taskDISABLE_INTERRUPTS();
    for (;;) {}
}
